logs/sysbench_fileio_1threads.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      2317.99
    writes/s:                     1545.33
    fsyncs/s:                     4950.44

Throughput:
    read, MiB/s:                  36.22
    written, MiB/s:               24.15

General statistics:
    total time:                          10.0161s
    total number of events:              88162

Latency (ms):
         min:                                    0.00
         avg:                                    0.11
         max:                                   21.13
         95th percentile:                        0.53
         sum:                                 9935.02

Threads fairness:
    events (avg/stddev):           88162.0000/0.00
    execution time (avg/stddev):   9.9350/0.00