logs/sysbench_fileio_2threads.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      3754.57
    writes/s:                     2503.05
    fsyncs/s:                     8023.03

Throughput:
    read, MiB/s:                  58.67
    written, MiB/s:               39.11

General statistics:
    total time:                          10.0188s
    total number of events:              142833

Latency (ms):
         min:                                    0.00
         avg:                                    0.14
         max:                                   21.97
         95th percentile:                        0.48
         sum:                                19911.72

Threads fairness:
    events (avg/stddev):           71416.5000/266.50
    execution time (avg/stddev):   9.9559/0.00