logs/sysbench_fileio_4threads.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      4269.24
    writes/s:                     2846.16
    fsyncs/s:                     9149.54

Throughput:
    read, MiB/s:                  66.71
    written, MiB/s:               44.47

General statistics:
    total time:                          10.0197s
    total number of events:              162471

Latency (ms):
         min:                                    0.00
         avg:                                    0.25
         max:                                   21.58
         95th percentile:                        0.86
         sum:                                39852.69

Threads fairness:
    events (avg/stddev):           40617.7500/191.19
    execution time (avg/stddev):   9.9632/0.00