logs/sysbench_fileio_8threads.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      4667.15
    writes/s:                     3111.76
    fsyncs/s:                     10047.86

Throughput:
    read, MiB/s:                  72.92
    written, MiB/s:               48.62

General statistics:
    total time:                          10.0263s
    total number of events:              177727

Latency (ms):
         min:                                    0.00
         avg:                                    0.45
         max:                                   22.72
         95th percentile:                        1.55
         sum:                                79746.51

Threads fairness:
    events (avg/stddev):           22215.8750/388.49
    execution time (avg/stddev):   9.9683/0.00